app/views/tasks/index.html.haml

          %li.active
            %i.icon-inbox= link_to('INBOX',"#{tasks_path}?key=inbox")
            .badge.pull-right.inbox= current_user.nodes.where(action: 'Inbox').count - 1
---
SELECT `nodes`.* FROM `nodes` WHERE `nodes`.`user_id` = 1