app/views/tasks/show.html.haml

      - suma = 0.0
      - @task.interruptions.where('interruptions.duration IS NOT NULL  ').each do |valor|
---
SELECT `interruptions`.* FROM `interruptions` WHERE `interruptions`.`task_id` = 5 AND (interruptions.duration IS NOT NULL (?) )