app/controllers/interruptions_controller.rb

  def create
    params[:interruption].merge!(task_id: params[:task_id], start_time: DateTime.parse(params[:interruption][:start_time]))
    interruption = Interruption.create interruption_params
---
INSERT INTO `interruptions` (`created_at`, `description`, `duration`, `end_time`, `name`, `start_time`, `task_id`, `updated_at`) VALUES ('2013-07-01 17:09:41', 'alumno pesado que viene a preguntar dudas', NULL, NULL, 'alumno ', '2013-07-01 17:09:41', 5, '2013-07-01 17:09:41')

  def stop_interruption
    interruption = current_user.tasks.find(params[:task_id]).interruptions.where(end_time: nil).first
    stop_time = DateTime.parse(params[:end_time])
    debugger
    seconds = Time.parse(stop_time.to_s) - Time.parse(interruption.start_time.to_s)
    interruption.task.activate! if interruption.update_attributes( end_time: stop_time , duration: seconds)
---
SELECT `interruptions`.* FROM `interruptions` WHERE `interruptions`.`task_id` = 5 AND `interruptions`.`end_time` IS NULL LIMIT 1
UPDATE "interruptions" SET "end_time" = '2013-06-25 17:14:41.000000', "duration" = 51.0, "updated_at" = '2013-06-25 17:14:41.455887' WHERE "interruptions"."id" = 1