app/controllers/projects_controller.rb

  def index
    @projects = current_user.projects.all
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1

  def show
    @project = current_user.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
      @project = current_user.nodes.find(params[:id])
---
SELECT "nodes".* FROM "nodes" WHERE "nodes"."type" IN ('Project') AND "nodes"."user_id" = 1 AND "nodes"."id" = ? LIMIT 1  [["id", "8"]]

  def create
    @project = current_user.projects.create(project_params)
---
INSERT INTO "projects" ("created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 19 Jun 2013 16:10:17 UTC +00:00], ["title", "Project 2"], ["updated_at", Wed, 19 Jun 2013 16:10:17 UTC +00:00], ["user_id", 1]]