app/controllers/tasks_controller.rb

  def index
    @interruption = Interruption.new
    @nodes = current_user.nodes
    @task = Task.new
    @project = Project.new
    @filter = params[:filter].present? ? Filter.new(params[:filter]) : Filter.new
    @calendar_nodes = current_user.tasks.where('start_time is not NULL')
---
SELECT `nodes`.* FROM `nodes` WHERE `nodes`.`type` IN ('Project') AND `nodes`.`user_id` = 1

  def create
    @task = current_user.tasks.build(task_params)

    if @task.save
---
INSERT INTO "tasks" ("created_at", "due_date", "note", "priority", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @task = Node.find(params[:id])
    @task.destroy
---
SELECT "nodes".* FROM "nodes" WHERE "nodes"."type" IN ('Task') AND "nodes"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "nodes" WHERE "nodes"."type" IN ('Task') AND "nodes"."id" = ?  [["id", 5]]