app/controllers/tasks_controller.rb

SELECT `nodes`.* FROM `nodes` WHERE `nodes`.`type` IN ('Task') AND `nodes`.`user_id` = 1 AND `nodes`.`task_name` = 'asdfasd'
SELECT `nodes`.* FROM `nodes` WHERE `nodes`.`type` IN ('Task') AND `nodes`.`user_id` = 1 AND `nodes`.`state` = 'paused'
---
  def index
    @interruption = Interruption.new
    @nodes = current_user.nodes
    @task = Task.new
    @project = Project.new
    @filter = params[:filter].present? ? Filter.new(params[:filter]) : Filter.new
    @date = params[:month] ? Date.parse(params[:month]) : Date.today

    if params[:filter].present?
      # prueba
      if params[:filter][:search] != ""
        @nodes = current_user.tasks.where(task_name: params[:filter][:search])
      end
      if params[:filter][:state] == "to_do"
        @nodes = current_user.tasks.where(state: params[:filter][:state])